function Book(dasaxeleba,avtori,weli,Janri,gamomcemloba,fasi)
	     {
		   this.dasaxeleba   = dasaxeleba;
		   this.avtori       = avtori;
		   this.weli         = weli;
		   this.Janri        = Janri;
		   this.gamomcemloba = gamomcemloba;
		   this.fasi         = fasi;
		 }
const Tsignebi=[]; 
    function FillBooks(){
    console.log(Tsignebi);
	Tsignebi.push(

		new Book("მოგონებები ლეონარდოს ბავშვობაზე"
			,"ზიგმუნდ ფროიდი"
			,"1978"
			,"ფილოსოფია"
			,"განათლება"
			,"5.50"),
		new Book("მხედვარი – უკანასკნელი სურვილი"
			,"ანჯეი საპკოვსკი"
			,"1993"
			,"რომანი"
			,"გამომცემლობა წიგნები ბათუმში"
			,"6.90"),
		
		new Book("ფანტასტიკური ღამე"
							  ,"შტეფან ცვაიგი"
							  ,"2008"
							  ,"პროზა"
							  ,"ლითერასი"
							  ,"1.50"),
		new Book("რწმენის კედელი"
							  ,"ჯანსუღ ჩარკვიანი"
							  ,"1983"
							  ,"პროზა"
							  ,"საბჭოთა საქართველო"
							  ,"1,65"),
		new Book("ქალი კამელიებით"
							  ,"ალექსანდრე დიუმა (შვილი)"
							  ,"1868"
							  ,"პოეზია"
							  ,"ლაბირინთი"
							  ,"3.90"),
		new Book("ამერიკელი ქალები"
							  ,"ტატიანა ტესი"
							  ,"1982"
							  ,"მოგზაურობა"
							  ,"ნაკადული"
							  ,"0.60"),
		new Book("მოგონებები"
							  ,"ილია ზურზბიშვილი"
							  ,"1977"
							  ,"პროზა"
							  ,"საბჭოთა საქართველო"
							  ,"2.60"),					  
		new Book("ბარონ მიუნჰაუზენის თავგადასავალი"
							  ,"რუდოლფ ერიხ რასპე"
							  ,"1902"
							  ,"დიდაქტიკა"
							  ,"განათლება"
							  ,"15.00"),
		new Book("ლექსები"
							  ,"იოსებ ნონეშვილი"
							  ,"1963"
							  ,"პოეზია"
							  ,"საბჭოთა საქართველო"
							  ,"0.71"),
	
		new Book("მოთხრობები"
							  ,"კონსტანტინე ლორთქიფანიძე"
							  ,"1967"
							  ,"პროზა"
							  ,"ლიტერატურა და ხელოვნება"
							  ,"1.00"),	 	

		 new Book("არსთა მესნევი"
								,"ჯალალ ედ-დინ რუმი"
								,"1272"
								,"პროზა"
								,"ბაკურ სულაკაურის გამომცემლობა"
								,"13.90"),

		 new Book("მარწუხებში. ასპერნის წერილები"
								,"ჰენრი ჯეიმზი"
								,"1898"
								,"პროზა"
								,"ბაკურ სულაკაურის გამომცემლობა"
								,"12.60"),

		 new Book("ამბავი უფლისწული გენჯისა"
								,"მურასაკი შიკიბუ"
								,"IV საუკუნე"
								,"რომანი"
								,"ბაკურ სულაკაურის გამომცემლობა"
								,"14.60"),

		 new Book("დიდი გეტსბი"
								,"ფრენსის სკოტ ფიცჯერალდი"
								,"1925"
								,"რომანი"
								,"ლითერასი"
								,"3.90"),

		 new Book("იდიოტი"
								,"ფიოდორ დოსტოევსკი"
								," "
								,"სატირიკული"
								,"ლითერასი"
								,"6.90"),

		 new Book("ანტიქრისტე"
								,"ფრიდრიხ ნიცშე"
								,"1895"
								,"ფილოსოფია"
								,"ინტეგრალი"
								,"4.90"),

		 new Book("დანაშაული და სასჯელი"
								,"ფიოდორ დოსტოევსკი"
								,"1866"
								,"რომანი"
								,"საქართველოს მაცნე"
								,"7.00"),

		 new Book("სოკრატეს აპოლოგია"
								,"პლატონი"
								," "
								,"ფილოსოფია"
								,"ლითერასი"
								,"2.50"),

		 new Book("წითელი და შავი"
								,"სტენდალი"
								,"1830"
								,"ფილოსოფია"
								,"ლითერასი"
								,"3.50"),

		 new Book("ომის ფილოსოფია"
								,"დიმიტრი უზნაძე"
								," "
								,"ფილოსოფია"
								,"ლითერასი"
								,"0.50"),

		 new Book("ოცდაათი წლის ქალი"
								,"ონორე დე ბალზაკი"
								,"1865"
								,"რომანი"
								,"ლიტერასი"
								,"4.90"),

		 new Book("ზიდჰართა"
								,"ჰერმან ჰესე"
								,"1922"
								,"პოემა"
								,"კავკასიური სახლი"
								,"2.00"),

		 new Book("შიმშილის ხელოვანი"
								,"ფრანც კაფკა"
								,"1921"
								,"ჰორორი"
								,"ინტეგრალი"
								,"1.50"),

		 new Book("ქართველი ერის ისტორია (II წიგნი)"
								,"ივანე ჯავახიშვილი"
								,"1908"
								,"ისტორია"
								,"ლიტერასი"
								,"4.00"),

		 new Book("უკანასკნელი დღე სიკვდილით დასასჯელისა"
								,"ვიქტორ ჰიუგო"
								,"1829"
								,"რომანი"
								,"ლიტერასი"
								,"1.50")
		 );
	        
}

FillBooks();